import { createFuncForCSV } from './FunctionalProgramming.js';

let csv = `44.38,34.33,Алушта,31440,
49.46,30.17,Біла Церква,200131,
49.54,28.49,Бердичів,87575,#некомент

#
46.49,36.58,#Бердянськ,121692,
49.15,28.41,Вінниця,356665,
#45.40,34.29,Джанкой,43343,

# в цьому файлі три рядки-коментарі :)`;

let text = `Біла Церква розташована в Київській області й відома своїм історичним минулим та мальовничим дендропарком «Олександрія». Вінниця приваблює туристів унікальним світломузичним фонтаном «Рошен», музеями та затишною атмосферою. Алушта зачаровує гірськими пейзажами, теплим кліматом і популярними курортами на узбережжі Чорного моря.`;

const formatText = createFuncForCSV(csv);

console.log(formatText(text));
